/**
  ******************************************************************************
  *               Copyright(C) 2022-2032 GDKY All Rights Reserved
  *
  * @file     fm33lg0xx_init.h
  * @author   ZouZH
  * @version  V1.00
  * @date     17-Jan-2022
  * @brief    FM33LG0XX power on default status.
  ******************************************************************************
  * @history
  */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SYS_CLOCK_H
#define __SYS_CLOCK_H

#ifdef __cplusplus
extern "C" {
#endif  /* __cplusplus */

/* INCLUDES ----------------------------------------------------------------- */
#include "fm33lg0xx_fl.h"

/* TYPEDEFS ----------------------------------------------------------------- */

/* MACROS  ------------------------------------------------------------------ */

/* CONSTANTS  --------------------------------------------------------------- */

/* GLOBAL VARIABLES --------------------------------------------------------- */

/* GLOBAL FUNCTIONS --------------------------------------------------------- */
void sysClockInit(void);    //œµÕ≥ ±÷”≈‰÷√

/* LOCAL VARIABLES ---------------------------------------------------------- */

/* LOCAL FUNCTIONS ---------------------------------------------------------- */


#ifdef __cplusplus
}
#endif  /* __cplusplus */

#endif /* __FM33LG0XX_INIT_H */


/***************************** END OF FILE ************************************/

